In [1]:
import pandas as pd
import numpy as np
series9=pd.Series(np.arange(10,20,7))
print(series9)

0    10
1    17
dtype: int64

In [2]:
#Mathematical operation on series
import pandas as pd
import numpy as np

seriesA = pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])
print(seriesA)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
seriesB = pd.Series([10,20,-10,-50,-100],index=["y","z","a","c","e"])
print(seriesB)

y     10
z     20
a    -10
c    -50
e   -100
dtype: int64

In [13]:
seriesA-seriesB

a     11.0
b      NaN
c     53.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [14]:
seriesA+seriesB

a    -9.0
b     NaN
c   -47.0
d     NaN
e   -95.0
y     NaN
z     NaN
dtype: float64

In [15]:
seriesA/seriesB

a   -0.10
b     NaN
c   -0.06
d     NaN
e   -0.05
y     NaN
z     NaN
dtype: float64

In [16]:
seriesA*seriesB

a    -10.0
b      NaN
c   -150.0
d      NaN
e   -500.0
y      NaN
z      NaN
dtype: float64

In [18]:
seriesB-seriesA

a    -11.0
b      NaN
c    -53.0
d      NaN
e   -105.0
y      NaN
z      NaN
dtype: float64

In [23]:
#Data Frame
#A data frame is a 2D labeled Data Structure like a table of MySql. It contains Rows and columns and therefore has both a row and column index.

#creation of Data Frame.

data={"Calories":[10,20,30],
      "Duration":[50,40,45]
     }
df=pd.DataFrame(data,index=["day1","day2","day3"])
print(df)

      Calories  Duration
day1        10        50
day2        20        40
day3        30        45

In [29]:
#creation of dataframe from numpy N-D-Array.

arr1=np.array([10,20,30])
arr2=np.array([100,200,300])
arr3=np.array([-10,-20,-30,-40])

df=pd.DataFrame([arr1,arr2,arr3],columns=["A","B","C","D"])
print(df)

     A    B    C     D
0   10   20   30   NaN
1  100  200  300   NaN
2  -10  -20  -30 -40.0

In [30]:
#Creation of DF from list of dict.

list_dict=[{"a":10,"b":20},{"a":5,"b":10,"c":15}]
df1=pd.DataFrame(list_dict)
print(df1)

    a   b     c
0  10  20   NaN
1   5  10  15.0

In [3]:
ResultSheet={"Smith":pd.Series([90,91,92], index=["Maths","Science","English"]),
            "Tony":pd.Series([92,81,86], index=["Maths","Science","English"]),
            "Jack":pd.Series([81,71,72], index=["Maths","Science","English"])}
RDF=pd.DataFrame(ResultSheet)
print(RDF)

         Smith  Tony  Jack
Maths       90    92    81
Science     91    81    71
English     92    86    72

In [5]:
RDF["Rahul"]=[90,98,99]
RDF

         Smith  Tony  Jack  Rahul
Maths       90    92    81     90
Science     91    81    71     98
English     92    86    72     99

In [10]:
RDF["Rahul"]=[60,61,63]
RDF

         Smith  Tony  Jack  Rahul
Maths       90    92    81     60
Science     91    81    71     61
English     92    86    72     63

In [25]:
#Adding a new row to a data frame.
RDF.loc["Hindi"]=[21,22,23,99]
RDF

         Smith  Tony  Jack  Rahul
Maths       70    70    70     70
English     92    86    72     63
Hindi       21    22    23     99

In [24]:
RDF.loc["Maths"]=70
RDF
#If we have to add same marks to a data frame we will write like this RDF.loc[:]=50

         Smith  Tony  Jack  Rahul
Maths       70    70    70     70
English     92    86    72     63
Hindi       21    22    23     99

In [ ]:
#deeleetion of row or column from data frame.
#we can use dataframe.drop method to delete row and column from a data frame. To delete a row the parameter axis is
#assigned the value zero and for deleting a column the parameter axis is assigned the value 1.

In [26]:
#For Row Deletion.
RDF=RDF.drop("Hindi",axis=0)
RDF

         Smith  Tony  Jack  Rahul
Maths       70    70    70     70
English     92    86    72     63

In [29]:
RDF.loc["Hindi"]=[30,43,67,99]
RDF

         Smith  Tony  Jack  Rahul
Maths       70    70    70     70
English     92    86    72     63
Hindi       30    43    67     99

In [32]:
RDF.loc["Hindi"]=35
RDF

         Smith  Tony  Jack
Maths       70    70    70
English     92    86    72
Hindi       35    35    35

In [30]:
RDF=RDF.drop(["Rahul"],axis=1)
RDF

         Smith  Tony  Jack
Maths       70    70    70
English     92    86    72
Hindi       30    43    67

In [54]:
#Rename Row label of a Data Frame

RDF=RDF.rename({"Maths":"Sub1","Science":"Sub2","Hindi":"sub3"},axis="index")
RDF

      stu1  stu2  stu3
Sub1    90    92    81
Sub2    91    81    71
Sub2    92    86    72

In [55]:
#Rename Column label of a Data Frame

RDF=RDF.rename({"Smith":"stu1","Tony":"stu2","Jack":"stu3"},axis="columns")
RDF

      stu1  stu2  stu3
Sub1    90    92    81
Sub2    91    81    71
Sub2    92    86    72

In [56]:
#Accessing DataFrame elemnts through indxing.
#1. Lable Based Indexing.

RDF.loc["Sub1"]

stu1    90
stu2    92
stu3    81
Name: Sub1, dtype: int64

In [12]:
#Accessing DataFrame element through slicing.
RDF.loc["Maths":"Science",["Rahul","Jack"]]

         Rahul  Jack
Maths       90    81
Science     98    71

In [18]:
#Joining Merging And Concatination of DataFrames.
dframe1=pd.DataFrame([[1,2,3],[4,5],[6]], columns=["C1","C2","C3"], index=["R1","R2","R3"])
dframe2=pd.DataFrame([[10,20],[30],[40,50]], columns=["C2","C5"], index=["R4","R2","R5"])
dframe2

    C2    C5
R4  10  20.0
R2  30   NaN
R5  40  50.0

In [21]:
dframe1=dframe1.append(dframe2)
dframe1

/var/folders/sp/2q6vh_9j0w1cb0bdct78zbm40000gn/T/ipykernel_883/4189934093.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dframe1=dframe1.append(dframe2)

     C1    C2   C3    C5
R1  1.0   2.0  3.0   NaN
R2  4.0   5.0  NaN   NaN
R3  6.0   NaN  NaN   NaN
R4  NaN  10.0  NaN  20.0
R2  NaN  30.0  NaN   NaN
R5  NaN  40.0  NaN  50.0
R4  NaN  10.0  NaN  20.0
R2  NaN  30.0  NaN   NaN
R5  NaN  40.0  NaN  50.0

In [23]:
dframe2=dframe2.append(dframe1)
dframe2

/var/folders/sp/2q6vh_9j0w1cb0bdct78zbm40000gn/T/ipykernel_883/1409203754.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dframe2=dframe2.append(dframe1)

      C2    C5   C1   C3
R4  10.0  20.0  NaN  NaN
R2  30.0   NaN  NaN  NaN
R5  40.0  50.0  NaN  NaN
R1   2.0   NaN  1.0  3.0
R2   5.0   NaN  4.0  NaN
R3   NaN   NaN  6.0  NaN
R4  10.0  20.0  NaN  NaN
R2  30.0   NaN  NaN  NaN
R5  40.0  50.0  NaN  NaN
R4  10.0  20.0  NaN  NaN
R2  30.0   NaN  NaN  NaN
R5  40.0  50.0  NaN  NaN
R1   2.0   NaN  1.0  3.0
R2   5.0   NaN  4.0  NaN
R3   NaN   NaN  6.0  NaN
R4  10.0  20.0  NaN  NaN
R2  30.0   NaN  NaN  NaN
R5  40.0  50.0  NaN  NaN
R4  10.0  20.0  NaN  NaN
R2  30.0   NaN  NaN  NaN
R5  40.0  50.0  NaN  NaN

In [24]:
#Attributes of DataFrame.

ResultSheet={"Smith":pd.Series([90,91,92], index=["Maths","Science","English"]),
            "Tony":pd.Series([92,81,86], index=["Maths","Science","English"]),
            "Jack":pd.Series([81,71,72], index=["Maths","Science","English"])}
RDF=pd.DataFrame(ResultSheet)
print(RDF.index)

Index(['Maths', 'Science', 'English'], dtype='object')

In [25]:
#To disp col label
RDF.columns

Index(['Smith', 'Tony', 'Jack'], dtype='object')

In [29]:
#To disp Row label
RDF.index

Index(['Maths', 'Science', 'English'], dtype='object')

In [31]:
#To disp data type of each column
RDF.dtypes

Smith    int64
Tony     int64
Jack     int64
dtype: object

In [32]:
#To disp dimension of Data Frame
RDF.shape

(3, 3)

In [33]:
#To Disp size of DF.
RDF.size

9

In [34]:
#To disp n no of rows from above.
RDF.head(1)

       Smith  Tony  Jack
Maths     90    92    81

In [35]:
#To disp n no of rows from below.
RDF.tail(1)

         Smith  Tony  Jack
English     92    86    72